#include <iostream>

/*  Колко свещички най-малко трябва да купите за своя дядо, който ще празнува своя 100 годишен рожден ден? 
 *  Предложете решение на проблема, използвайки най-малък брой свещички.
 */
int main()
{
	// 100 (10) -> 1100100 (2) -> 001 | 100 | 100 (2) -> 144 (8) -> 0110 | 0100 (2) -> 64 (16)

	// Ако използваме десетична бройна система, ще са ни необходимми 3 свещички, двойчна - 7, осмична - 3 и шеснайсетична - 2.
	// Ако използваме обаче 100-чна бройна система, то един символ ни е необходим -> 0. 100 % 100 = 0.

	return 0;
}